[{"English":"Al-Baqara: O you who believe! fasting is prescribed for you, as it was prescribed for those before you, so that you may guard (against evil)","Urdu":"البقرہ: اے ایمان والو! تم پر روزے فرض کیے گئے ہیں جس طرح تم سے پہلے لوگوں پر فرض کیے گئے تھے تاکہ تم پرہیزگاری اختیار کرو۔"},{"English":"Al-Baqara: For a certain number of days; but whoever among you is sick or on a journey, then (he shall fast) a (like) number of other days","Urdu":"البقرہ: چند دنوں کے لیے۔ لیکن تم میں سے جو کوئی بیمار ہو یا سفر پر ہو تو وہ دوسرے دنوں کی تعداد میں روزے رکھے۔"},{"English":"Al-Baqara: And those who are not able to do it may effect a redemption by feeding a poor man","Urdu":"البقرہ: اور جو اس کی استطاعت نہیں رکھتے وہ کسی مسکین کو کھانا کھلا کر فدیہ لے سکتے ہیں۔"},{"English":"Al-Baqara: The month of Ramazan is that in which the Quran was revealed, a guidance to men and clear proofs of the guidance and the distinction","Urdu":"البقرہ: رمضان وہ مہینہ ہے جس میں قرآن نازل کیا گیا جو لوگوں کے لیے ہدایت ہے اور ہدایت اور امتیاز کی واضح دلیلیں ہیں۔"},{"English":"Al-Baqara: Allah desires ease for you, and He does not desire for you difficulty","Urdu":"البقرہ: اللہ تمہارے لیے آسانی چاہتا ہے اور تمہارے لیے تنگی نہیں چاہتا"},{"English":"Al-Baqara: Eat and drink until the whiteness of the day becomes distinct from the blackness of the night at dawn, then complete the fast till night","Urdu":"البقرہ: کھاؤ پیو یہاں تک کہ دن کی سفیدی رات کی تاریکی سے فجر کے وقت واضح ہو جائے، پھر رات تک روزہ پورا کرو۔"},{"English":"Al-Baqara: Those who believe in the unseen and keep up prayer and spend out of what We have given them.","Urdu":"البقرہ: وہ لوگ جو غیب پر ایمان رکھتے ہیں اور نماز قائم کرتے ہیں اور جو کچھ ہم نے انہیں دیا ہے اس میں سے خرچ کرتے ہیں۔"},{"English":"Al-Baqara: These are on a right course from their Lord and these it is that shall be successful","Urdu":"البقرہ: یہی لوگ اپنے رب کی طرف سے سیدھے راستے پر ہیں اور یہی لوگ فلاح پانے والے ہیں۔"},{"English":"Al-Baqara: O men! serve your Lord Who created you and those before you so that you may guard (against evil).","Urdu":"البقرہ: اے لوگو! اپنے رب کی بندگی کرو جس نے تمہیں اور تم سے پہلے لوگوں کو پیدا کیا تاکہ تم پرہیزگار بنو۔"},{"English":"Al-Baqara:He it is Who created for you all that is in the earth,and He directed Himself to the heaven,so He made them complete seven heavens","Urdu":"البقرہ: وہی ہے جس نے تمہارے لیے جو کچھ زمین میں ہے پیدا کیا، اور اس نے اپنے آپ کو آسمان کی طرف متوجہ کیا، تو اس نے ان کو سات آسمان بنائے۔"},{"English":"Al-Baqara: And do not mix up the truth with the falsehood, nor hide the truth while you know","Urdu":"البقرہ: اور حق کو باطل کے ساتھ نہ ملایا کرو اور نہ حق کو چھپاؤ جبکہ تم جانتے ہو۔"},{"English":"Al-Baqara: And keep up prayer and pay the poor-rate and bow down with those who bow down","Urdu":"البقرہ: اور نماز قائم کرو اور زکوٰۃ دو اور رکوع کرنے والوں کے ساتھ رکوع کرو"},{"English":"Al-Baqara: And seek assistance through patience and prayer, and most surely it is a hard thing except for the humble ones","Urdu":"البقرہ: اور صبر اور نماز سے مدد حاصل کرو، اور بیشک یہ بہت مشکل کام ہے سوائے عاجزی کرنے والوں کے۔"},{"English":"Al-Baqara: Do they not know that Allah knows what they keep secret and what they make known?","Urdu":"البقرہ: کیا وہ نہیں جانتے کہ اللہ جانتا ہے جو وہ چھپاتے ہیں اور جو ظاہر کرتے ہیں؟"},{"English":"Al-Baqara: Do you not know that Allah's is the kingdom of the heavens and the earth, and that besides Allah you have no guardian or helper?","Urdu":"البقرہ: کیا تم نہیں جانتے کہ آسمانوں اور زمین کی بادشاہی اللہ ہی کی ہے اور اللہ کے سوا تمہارا کوئی ولی اور مددگار نہیں۔"},{"English":"Al-Baqara: The truth is from your Lord, therefore you should not be of the doubters","Urdu":"البقرہ: حق تیرے رب کی طرف سے ہے اس لیے شک کرنے والوں میں سے نہ ہونا"},{"English":"Al-Baqara: O you who believe! seek assistance through patience and prayer; surely Allah is with the patient","Urdu":"البقرہ: اے ایمان والو! صبر اور نماز کے ذریعے مدد طلب کرو؛ بے شک اللہ صبر کرنے والوں کے ساتھ ہے۔"},{"English":"Al-Baqara: And your Allah is one Allah! there is no god but He; He is the Beneficent, the Merciful","Urdu":"البقرہ: اور تمہارا معبود ایک ہی ہے۔ اس کے سوا کوئی معبود نہیں۔ وہ رحم کرنے والا، رحم کرنے والا ہے۔"},{"English":"Sorah qadar:Surely We revealed it on the grand night.","Urdu":"سورہ قدر: بے شک ہم نے اسے شب قدر میں نازل کیا۔"},{"English":"Sorah qadar:And what will make you comprehend what the grand night","Urdu":"سورہ قدر: اور کیا چیز تمہیں سمجھے گی کہ عظیم رات کیا ہے۔"},{"English":"Sorah qadar:The grand night is better than a thousand months.","Urdu":"سورہ قدر: شب قدر ہزار مہینوں سے بہتر ہے۔"},{"English":"Sorah qadar: The angels and Gibreel descend in it by the permission of their Lord for every affair,","Urdu":"سورہ قدر: اس میں فرشتے اور جبریل اپنے رب کے حکم سے ہر کام کے لیے اترتے ہیں۔"},{"English":"Sorah qadar: Peace! it is till the break of the morning.","Urdu":"سورہ قدر: السلام علیکم! یہ صبح کے وقفے تک ہے."},{"English":"Al-Baqara: And fight in the way of Allah with those who fight with you, and do not exceed the limits, surely Allah does not love those who exceed the limits.","Urdu":"البقرہ: اور اللہ کی راہ میں ان لوگوں سے لڑو جو تم سے لڑتے ہیں اور حد سے نہ بڑھو، بے شک اللہ حد سے بڑھنے والوں کو پسند نہیں کرتا۔"},{"English":"Al-Baqara: O you who believe! enter into submission one and all and do not follow the footsteps of Shaitan; surely he is your open enemy.","Urdu":"البقرہ: اے ایمان والو! ایک دوسرے کے تابع ہو جاؤ اور شیطان کے نقش قدم پر نہ چلو۔ یقیناً وہ تمہارا کھلا دشمن ہے۔"},{"English":"Al-Baqara: Kind speech and forgiveness is better than charity followed by injury; and Allah is Self-sufficient, Forbearing.","Urdu":"البقرہ: اچھی بات اور درگزر کرنا اس خیرات سے بہتر ہے جس کے بعد تکلیف ہو۔ اور اللہ بے نیاز، بردبار ہے۔"},{"English":"Dukhan: Surely We revealed it on a blessed night surely We are ever warning.","Urdu":"دخان: یقیناً ہم نے اسے ایک بابرکت رات میں نازل کیا ہے، یقیناً ہم ڈرانے والے ہیں۔"},{"English":"Aal-e-imran:Allah, (there is) no god but He, the Ever-Living, the Self-subsisting by Whom all things subsist","Urdu":"آل عمران: اللہ، اس کے سوا کوئی معبود نہیں، ہمیشہ زندہ رہنے والا، خود قائم رہنے والا جس کے ذریعے ہر چیز چلتی ہے۔"},{"English":"Aal-e-imran:Our Lord! make not our hearts to deviate after Thou hast guided us aright, and grant us from Thee mercy; surely Thou art the most liberal Giver","Urdu":"آل عمران: اے ہمارے رب! ہمیں ہدایت دینے کے بعد ہمارے دلوں کو ٹیڑھا نہ کر اور ہمیں اپنی طرف سے رحمت عطا فرما۔ بے شک تو سب سے زیادہ آزاد دینے والا ہے۔"},{"English":"Aal-e-imran:Say: If you love Allah, then follow me, Allah will love you and forgive you your faults, and Allah is Forgiving, Merciful","Urdu":"آل عمران: کہہ دو کہ اگر تم اللہ سے محبت کرتے ہو تو میری پیروی کرو، اللہ تم سے محبت کرے گا اور تمہاری خطاؤں سے درگزر کرے گا، اور اللہ بخشنے والا مہربان ہے۔"},{"English":"Al-Baqara: O you who believe! fasting is prescribed for you, as it was prescribed for those before you, so that you may guard (against evil)","Urdu":"آج کی آیت: یہ (کفر کرنے والے) لوگ بڑی زور دار قسمیں کھا کر کہا کرتے تھے کہ اگر ان کے پاس کوئی خبر دار کرنے والا (رسول) آگیا ہوتا تو وہ دنیا کی ہر دوسری قوم سے بڑھ کر ہدایت قبول کرنے والے ہوتے۔ مگر جب خبردار کرنے والا ان کے پاس آگیا تو اس کی آمد سے تو بس ان کی نفرت ہی کو ترقی ہوئی، سورة فاطر 35، آیت 42"}]